# 이제 뭘 (공부)해야 할까?


# 파이썬 스터디 주요분야
# 1. 데이터 분석 : 머신러닝, 통계, Visualization
# 2. 웹 프로그래밍 : 웹 프레임워크
# 3. 파이썬 성능 향상 : 동시성, 프로파일링
# 4. 코드 작성 & 협업 : 파이썬 문서화, Github


# 1. 데이터 분석
#  1) Scikit-Learn : 머신러닝 라이브러리
#  2) Matplotlib : 데이터 시각화 라이브러리
#  3) Numpy : 과학 연산을 위한 라이브러리
#  4) Pandas : 데이터 handling을 위하 라이브러리
#  5) Tensorflow : 딥러닝/머신러닝 라이브러리


# 2. 웹 프로그래밍
#  1) Django : 가장 널리 쓰이는 파이썬 웹 프레임워크
#  2) flask : 경량(micro) 파이썬 웹 프레임워크, Easy & Simple

# 3. 파이썬 성능 향상
# - 동시성 : 한번에 한가지 이상의 Task를 실행 시키기!
# - Profiling : 메모리/연산이 많은 지점 확인 하기

# 4. 코드 작성 & 협업
# - Git, Github 스터디