
# 디렉토리
# - 폴더 또는 디렉토리라고 불림
# - 파일과 다른 디렉토리를 포함할 수 있음

# 파일
# - 컴퓨터에서 정보를 저장하는 논리적인 단위
# - 파일명과 확장자로 식별됨
# - 실행, 쓰기, 읽기 등을 할 수 있음
#
# 1) Binary File
# - 컴퓨터만 이해할 수 있는 형태인 이진법 형식으로 저장된 파일
# - 일반적인 메모장으로 열면 내용이 깨져 버림
# - 엑셀, 워드 파일 등
#
# 2) Text File
# - 인간이 이해할 수 있는 형태인 문자열 형식으로 저장된 파일
# - 메모장으로 열면 내용 확인 가능
# - 메모장에 저장된 파일, HTML파일, Python Code 파일 등

# 컴퓨터는 Text파일을 처리하기 위해 Binary파일로 변환시킴 ex)'.pyc'파일
# 즉, 모든 Text파일도 실제로는 Binary 형태
# 다만, ASCII/Unicode 문자열 집합으로 저장되어 사람이 읽을 수 있음

# ASCII Code Table
# 십진수 0 ~ 127 혹는 십육진수 0x00 ~ 0x7F 사이에 어셈블리명령어, 기호, 숫자, 알파벳 대소문자을 입력
